Repository: 84000/data-translation-memory
Catalog: toh67-v3.tmx
Source language: bo
Languages: en

source: །འོད་སྲུང་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་དེ་དག་ལས་ཉན་ཐོས་ཀྱི་ཐེག་པ་པར་གྱུར་པའི་སེམས་ཅན་གང་དག་ཡིན་པ་དེ་དག་ལས་སེམས་ཅན་གཅིག་འགའ་ཙམ་ཡང་སོ་སོ་སྐྱེ་བོར་གྱུར་བཞིན་འཆི་བའི་དུས་བྱས་པར་མ་གྱུར་ཏེ།
en: Kāśyapa, out of the beings in the four-continent universes who entered the Śrāvaka Vehicle, not a single one died as an ordinary person.

source: གང་དག་ཐམས་ཅད་ཀྱི་ནང་ན་ལེ་ལོ་ཅན་དུ་གྱུར་པ་དེ་དག་ཀྱང་ཕྱིར་མི་འོང་བར་གྱུར་ཅིང་། དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་པར་གྱུར་ཏོ།
en: Among them all, even those who were lazy became non-returners who, after their deaths, were reborn with equal status to the class of gods of the Pure Abodes.

source: །གང་དག་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པར་གྱུར་པ་དེ་དག་ནི་དེ་ནས་ཤི་འཕོས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་སངས་རྒྱས་འབྱུང་བ་མེད་པ་གཞན་དག་ཏུ་སྐྱེས་པར་གྱུར་ཅིང་། དེར་ཡང་དེ་དག་ཕྱུག་པོའི་ཁྱིམ་ཆེན་པོ་དག་ཏུ་སྐྱེས་པར་གྱུར་ཏོ།
en: Those who entered the Pratyekabuddha Vehicle, after their deaths, were reborn in other empty buddha fields in which no buddha had arisen; moreover, they were born there into large, rich households.

source: །དེར་སྐྱེས་ནས་ཀྱང་དབང་པོ་འཕེལ་བ་དང་། ཡོངས་སུ་སྨིན་པ་དག་ཀྱང་རྗེས་སུ་ཐོབ་ནས་སྔོན་གྱི་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་ཡང་དག་པར་བསྐུལ་ཏེ། ཐམས་ཅད་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་ལེགས་པ་ཁོ་ནར་རབ་ཏུ་བྱུང་ངོ་།
en: Once reborn there, their faculties developed and matured until they were aroused by their previous roots of virtue, and they all faithfully went forth from their homes into homelessness, just as is proper.

source: །དེ་དག་དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་ཀྱང་ཞག་བདུན་འདས་ནས་ཐམས་ཅད་ཀྱིས་རང་བྱང་ཆུབ་རྗེས་སུ་ཐོབ་སྟེ། དེ་དག་གིས་ཀྱང་སེམས་ཅན་ཚད་མེད། གྲངས་མེད་པ་དག་གི་དོན་བྱས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ།
en: Seven days after they went forth, all of them attained the awakening of a pratyekabuddha and, after benefiting immeasurable, countless beings, passed into final nirvāṇa. “

source: །གང་དག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པར་གྱུར་པ་དེ་དག་གིས་ནི་མངོན་པར་ཤེས་པ་ལྔ་དང་། ཚངས་པའི་གནས་པ་བཞི་བསྒྲུབས་ཤིང་མི་འཕྲོགས་པའི་སྤོབས་པ་ཉིད་ཀྱང་རྗེས་སུ་ཐོབ་པར་གྱུར།
en: Those who were followers of the Bodhisattva Vehicle accomplished the five extraordinary abilities and the four sublime states, and they also attained inalienable eloquence and retention. “

source: གཟུངས་ཀྱང་ཐོབ་པར་གྱུར་ཏོ། །འོད་སྲུང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་མུ་ཁྱུད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་ཡིད་གཉིས་སམ་ཐེ་ཚོམ་ཟ་བར་གྱུར་ན་འོད་སྲུང་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Kāśyapa, if you are undecided or doubtful as to whether, at that particular time, the king named Nimi was someone else, do not view it that way.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་གླིང་བཞི་པའི་དབང་ཕྱུག་གི་རྒྱལ་པོ་མུ་ཁྱུད་ཅེས་བྱ་བ་དེར་གྱུར་ཏོ།
en: For I myself, at that particular time, was the King called Nimi, with dominion over the four continents.

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ནི་རྒྱལ་བུ་གཞོན་ནུ་ཐུ་བོར་གྱུར་ཏོ།
en: The bodhisattva Maitreya was the eldest young prince.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ནི་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Kāśyapa, the tathāgata, arhat, completely awakened Buddha was the bodhisattva Sumati. “

source: །འོད་སྲུང་དེའི་ཚེ་དེའི་དུས་ན་ཁྱེའུ་ཆོས་དང་། ཆོས་བཟང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཉིས་གཞན་དག་ཅིག་ཡིན་སྙམ་དུ་ཁྱོད་དེ་སྙམ་སེམས་ན་འོད་སྲུང་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ།
en: Kāśyapa, if you think that, at that particular time, the two youths Dharma and Sudharma were someone else, do not view it that way.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་ཁྱེའུ་ཆོས་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: That is because Mañjuśrīkumārabhūta himself was, at that particular time, the youth named Dharma.

source: །ཁྱེའུ་ཆོས་བཟང་ཞེས་བྱ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་སྙིང་པོ་ཡིན་ཏེ།
en: It was the bodhisattva great being Suryagarbha who was the youth named Sudharma. “

source: འོད་སྲུང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་སེམས་ཅན་དག་པ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་རྣམས་ཀྱི་གནས་སུ་གྱུར་ཅིང་ཇི་ཙམ་དུ་མཛེས་པར་གྱུར་པ་ལ་ལྟོས། དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Kāśyapa, that buddha field was where pure beings who generated roots of virtue dwelt; consider how beautiful it was!”

source: བཅོམ་ལྡན་འདས་ལ་གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེའི་སྐུ་ཚེའི་ཚད་ཡུན་ཇི་སྲིད་ཅིག་ཏུ་གྱུར་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: In reply to what the Blessed One had said, the elder Mahākāśyapa asked, “Blessed One, how long was the life of the blessed Tathāgata Myriad Flowers?”

source: འོད་སྲུང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་སྣ་ཚོགས་དེ་ནི་བསྐལ་པ་བརྒྱད་ཀྱི་བར་དུ་བཞུགས་པར་གྱུར་ཏོ།
en: The Blessed One answered, “Kāśyapa, the tathāgata, arhat, completely awakened Buddha Myriad Flowers lived for eight eons.

source: །འོད་སྲུང་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་ནི་བསྐལ་པ་གཅིག་གི་བར་དུ་གནས་པར་གྱུར་ཏོ།
en: Kāśyapa, after the Tathāgata Myriad Flowers had passed into final nirvāṇa, his Dharma remained for one eon.

source: །དེའི་སྐུ་གདུང་རྣམས་ཀྱང་རྒྱས་པར་གྱུར་ཅིང་དེ་དག་ལྷ་རྣམས་ཁོ་ནས་མཆོད་པར་གྱུར་ཏེ།
en: His bodily relics were distributed and were worshiped exclusively by gods.

source: དེ་ན་མི་ཁྱིམ་པར་གནས་པ་ནི་འགའ་ཡང་མེད་དོ།
en: Then there were none who lived in households. “

source: །འོད་སྲུང་དེ་ན་དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་བྱ་བ་ཉུང་བ་དང་། བདག་གི་དོན་ལ་སྦྱོར་བའི་རྗེས་སུ་བརྩོན་པར་གནས་ཤིང་བཅོམ་ལྡན་འདས་དེའི་སྐུ་གདུང་རྣམས་ལ་ཡང་མཆོད་པ་མི་བྱེད།
en: Kāśyapa, the two monks Dharma and Sudharma had few activities then, and they assiduously practiced for their own good; they did not make offerings to or honor the relics of the Blessed One.

source: རི་མོར་མི་བྱེད་ལ། དེ་བཞིན་གཤེགས་པ་དེའི་མཆོད་རྟེན་གྱི་དྲུང་དུ་ཡང་མི་འགྲོའོ།
en: Nor did they even go to the stūpa of the Tathāgata.

source: །འོད་སྲུང་དེ་ནས་ལྷ་འབུམ་ཕྲག་རབ་ཏུ་མང་པོ་དང་། དགེ་སློང་ལས་དང་པོ་པ་གང་དག་ཡིན་པ་དེ་དག་དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་ལ་འདི་གཉིས་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་ལ་མཆོད་པ་ཡང་མི་བྱེད།
en: Then, Kāśyapa, many hundreds of thousands of gods and those who were novice monks criticized the monks Dharma and Sudharma, saying, ‘These two do not worship the relics of the Tathāgata!

source: དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་བསྐོར་བར་ཡང་མི་བྱེད་པ་ལས་ན་མ་དད་པ་དང་མ་གུས་པ་ཡིན་ནོ་ཞེས་ཁ་ཟེར་བར་གྱུར་ཏོ།
en: They do not circumambulate the Tathāgata’s stūpa. They are therefore impious and disrespectful.’ “

source: །འོད་སྲུང་དེ་ནས་དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་ཀྱིས་དགེ་སློང་དང་། ལྷ་འབུམ་ཕྲག་རབ་ཏུ་མང་པོ་འདུས་པར་གྱུར་པའི་དགེ་སློང་གི་འཁོར་དང་། ལྷའི་འཁོར་མང་པོ་དེ་དག་ལ་སྨྲས་པ། གྲོགས་པོ་དག་འདི་ཇི་སྙམ་དུ་སེམས།
en: Then, Kāśyapa, the two monks Dharma and Sudharma said to the many retinues of gods and the retinue of monks, the many hundreds of thousands of monks and gods, ‘Friends, what do you think?

source: ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་མཆོད་པར་འགྱུར་ཞིང་རྒྱུ་གང་གིས་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་སེམས་པ་མི་མངའ་བ་རྣམས་ཀྱིས་མཆོད་པ་བརྙེས་པར་འགྱུར་སྙམ། དགེ་སློང་དང་། ལྷ་དེ་དག་གིས་སྨྲས་པ། སྐུ་གདུང་འདི་དག་ནི་ཚུལ་ཁྲིམས་དང་།
en: How does a tathāgata come to be worshiped, and why do the relics of a tathāgata, which are inanimate, receive worship?’

source: ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་པས་རབ་ཏུ་ཕྱེ་བ་ཡིན་པས་ན་དེའི་ཕྱིར་འདི་དག་ནི་མཆོད་པར་འོས་པ་ཡིན་ནོ། །དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The monks and gods replied, ‘Because these relics are manifested by moral discipline, samādhi, wisdom, liberation, and the knowledge and vision of liberation, they are worthy of worship.’

source: །གྲོགས་པོ་དག་འོ་ན་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དག་ཉིད་མཆོད་པའི་འོས་ཡིན་གྱི། སྐུ་གདུང་དག་ནི་མཆོད་པར་འོས་པར་མི་འགྱུར་བ་མ་ཡིན་ནམ།
en: The monks Dharma and Sudharma said, ‘But, friends, is it not that moral discipline, samādhi, wisdom, liberation, and the knowledge and vision of liberation are themselves worthy of worship, but bodily relics are not?’

source: དགེ་སློང་དང་། ལྷ་དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་ནི་དེ་བཞིན་ཏེ།
en: The monks and gods replied, ‘That is right; it is as you say.’

source: ཇི་སྐད་སྨྲས་པ་བཞིན་ནོ། །དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་ཀྱིས་སྨྲས་པ། གྲོགས་པོ་དག་འོ་ན་ཚུལ་ཁྲིམས་ཀྱི་མཚན་ཉིད་ནི་གང་ཡིན།
en: The monks Dharma and Sudharma said, ‘Then, friends, what is the characteristic of moral discipline?

source: ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དག་གི་མཚན་ཉིད་ཀྱང་གང་ཡིན།
en: And what characterizes samādhi, wisdom, liberation, and the knowledge and vision of liberation?’

source: དགེ་སློང་དང་། ལྷ་དེ་དག་གིས་སྨྲས་པ། ཚུལ་ཁྲིམས་ནི་མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་མཚན་ཉིད་ཡིན་ནོ།
en: The monks and gods replied, ‘The characteristic of moral discipline is that it is not conditioned.

source: །ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དག་ཀྱང་མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་མཚན་ཉིད་ཡིན་ནོ།
en: Samādhi, wisdom, liberation, and the knowledge and vision of liberation are also characterized as not conditioned.’ “

source: །འོད་སྲུང་དེ་ནས་དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་ཀྱིས་དགེ་སློང་དང་། ལྷ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དག་འོ་ན་མངོན་པར་འདུ་བྱེད་པས་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་མཆོད་པར་ནུས་སམ།
en: Then, Kāśyapa, the monks Dharma and Sudharma said to those monks and gods, ‘Then, friends, can what is conditioned worship what is unconditioned?’

source: དགེ་སློང་དང་། ལྷ་དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་ནི་མི་ནུས་སོ།
en: The monks and gods replied, ‘No, it cannot.’ “

source: །དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དག་དེ་ལྟ་བས་ན་ཁྱེད་ཀྱང་བདག་ཏུ་མངོན་པར་འདུ་མ་བྱེད་ཅིག་དང་དེས་ནི་མཆོད་པ་བྱས་པར་འགྱུར་རོ།
en: The monks Dharma and Sudharma said, ‘In that case, friends, do not fashion a self, and that will be your worship.

source: །སངས་རྒྱས་སུ་འདུ་ཤེས་པ་ལ་ནི་སངས་རྒྱས་མཐོང་བ་ཡང་མེད་ན་མཆོད་པའི་ལས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ་དེ་ནི་གནས་མེད་དོ།
en: As for the perception of a buddha—if there is not even a buddha to see, we need hardly say that the act of worship is baseless.

source: །གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་མཆོད་པར་འདོད་པས་ནི་བདག་ཉིད་མཆོད་པར་བྱའོ།
en: Furthermore, someone who wishes to make an offering to the Tathāgata should offer themselves.’ “

source: །དགེ་སློང་དང་། ལྷ་དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་མཆོད་པར་འདོད་པས་བདག་ཉིད་མཆོད་པར་བྱ།
en: The monks and gods replied, ‘How should someone who wishes to make an offering to the Tathāgata offer themselves?’ “

source: དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་ཀྱིས་སྨྲས་པ། གྲོགས་པོ་དག་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་མཆོད་པ་གང་གིས་བདག་ཉིད་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མཆོད་པའི་གནས་སུ་འོས་པར་མཛད་པ་དེ་ལྟར་བདག་ཉིད་མཆོད་པར་བྱའོ།
en: The monks Dharma and Sudharma said, ‘Friends, just as the tathāgata, arhat, perfectly awakened Buddha makes offerings that render him worthy of the worship that all beings offer, so should one offer oneself.

source: །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་བསླབས་པ་དེ་ལྟར་བསླབ་པར་བྱ་ཞིང་བསླབ་པས་རློམ་སེམས་སུ་ཡང་མི་བྱའོ།
en: One should train oneself just as the Tathāgata trained, without becoming conceited about the training.

source: །ཆོས་རབ་ཏུ་དབྱེ་བར་བྱ་ཞིང་རབ་ཏུ་ཕྱེ་ནས་ཀྱང་ཆོས་འགའ་ཡང་བསམ་པར་མི་བྱ་སྟེ།
en: One should analyze phenomena in detail, and after analyzing them one should not contemplate any phenomena at all.

source: གང་གི་ཚེ་ཁྱེད་ཅག་དེ་ལྟར་བདག་ཉིད་མཆོད་པར་བྱེད་པ་དེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་ཡང་མཆོད་པར་འགྱུར།
en: When you offer yourselves in that way, you also offer worship to the Tathāgata.

source: ཁྱེད་ཅག་ཉིད་ཀྱང་མཆོད་པར་འོས་པར་འགྱུར་རོ།
en: You, yourselves, will also become worthy of worship.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་ལ་མཆོད་པར་འདོད་པས་ནི་བདག་ཉིད་མཆོད་པར་བྱ་སྟེ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་བདག་ཉིད་མཆོད་པར་མཛད་པ་དེ་ལྟར་མཆོད་པར་བྱ་ཞིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་ཡོན་ཏན་གང་དག་དང་ལྡན་པས་མཆོད་པ་བརྙེས་པར་གྱུར་པའི་ཡོན་ཏན་དེ་དག་བདག་ཉིད་ཀྱིས་བསྒྲུབ་པར་བྱ་སྟེ།
en: Someone who wishes to offer worship to the bodily relics of the Tathāgata should offer themselves; one should offer worship just as the Tathāgata offers himself, and one should accomplish oneself those good qualities of the bodily relics of the Tathāgata, due to the possession of which he receives worship.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་མཆོད་པར་འགྱུར་རོ།
en: That is how the Tathāgata is worshiped. “‘

source: །གང་འདུ་ཤེས་དང་། མཚན་མ་སྐྱེད་པར་མི་བྱེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ།
en: Not generating perceptions or signs is worship of the Tathāgata.

source: །གང་བདག་ཏུ་རྟོག་པར་མི་བྱེད་པ་དང་། རྣམ་པར་རྟོག་པར་མི་བྱེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ།
en: Not conceptualizing a self or engaging in thoughts is worship of the Tathāgata.

source: །གང་འཇིག་རྟེན་ཕ་རོལ་ཏུ་མི་འགྲོ་བ་དང་། འཇིག་རྟེན་འདིར་མི་འོང་བ་དང་། གང་ཚུ་རོལ་ལ་ཡང་མི་གནས། ཕ་རོལ་ལ་ཡང་མི་གནས་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ། །གང་ལ་ཆད་པ་མེད་པ་དང་།
en: Not going to the next world, not coming into this world, and not even remaining here or in the next world is worship of the Tathāgata.

source: རྟག་པ་མེད་པ་དང་། གང་ལ་འཛིན་པ་མེད་པ་དང་། སྤོང་བ་མེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ། །གང་ལ་འབྲི་བ་མེད་པ་དང་། འཕེལ་བ་མེད་པ་དང་།
en: The absence of annihilation and permanence and the absence of holding on and letting go is worship of the Tathāgata.

source: གང་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། གང་ལ་ཟད་པ་མེད་པ་དང་། མི་ཟད་པ་མེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ། །གང་ལ་སེམས་མེད་པ་དང་། སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་མེད་པ་དང་། ཡིད་ལ་བྱེད་པ་རྣམས་མེད་པ་དང་། བདག་གི་མེད་པ་དང་།
en: The absence of decreasing and increasing, the absence of arising and ceasing, and the absence of extinguishing and nonextinguishing is worship of the Tathāgata.

source: ཡོངས་སུ་འཛིན་པ་མེད་པ་དང་། ཚོར་བ་མེད་པ་དང་། འཐབ་པ་མེད་པ་དང་། རྩོད་པ་མེད་པ་དང་། འགལ་བ་མེད་པ་དང་།
en: The absence of mind and mental events, the absence of thinking, the absence of possessiveness, the absence of appropriation, the absence of sensation, the absence of quarreling, the absence of argument, the absence of contradiction, the absence of acceptance, the absence of rejection, and engagement with nonduality is worship of the Tathāgata.

source: བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པ་དང་། གཉིས་སུ་མེད་པར་འཇུག་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ། །གང་ལ་འདུས་བྱས་མེད་པ་དང་། གྲངས་མེད་པ་དང་། བགྲ
en: The absence of conditioning, the absence of enumeration, and the absence of quantifying is worship of the Tathāgata.

source: ང་དུ་མེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ། །གང་ལ་ལུས་དང་། ངག་དང་། ཡིད་ཀྱིས་མངོན་པར་འདུ་བྱེད་པའི་བྱ་བ་མེད་པ་དང་། ལུས་དང་། ངག་དང་། ཡིད་མི་དམིགས་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ། །གང་ལ་འདས་པའི་འདུ་ཤེས་མི་འཇུག་པ་དང་།
en: The absence of physical, verbal, and mental conditioning, and the nonapprehension of body, speech, and mind, is worship of the Tathāgata.

source: ད་ལྟར་དང་། མ་འོངས་པའི་འདུ་ཤེས་མི་འཇུག་པ་དང་། གང་རྟེན་པར་མི་བྱེད་པ་དང་། མངོན་པར་ཞེན་པར་མི་བྱེད་པ་དང་། མཚན་མར་མི་བྱེད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ།
en: The absence of engaging in perceptions of the past, the present, and the future, not depending, not clinging, and not signifying is worship of the Tathāgata.

source: །གང་སངས་རྒྱས་སུ་འདུ་ཤེས་མི་འཇུག་པ་དང་། ཆོས་སུ་མ་ཡིན། དགེ་འདུན་དུ་མ་ཡིན། གང་ཟག་ཏུ་མ་ཡིན། བདག་ཏུ་མ་ཡིན།
en: Not engaging with the perception of a buddha and with what is not the Dharma, or the Saṅgha, or a person, or self, or other is worship of the Tathāgata. “ ‘

source: གཞན་དུ་མ་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ཡིན་ནོ།། །།བམ་པོ་བཞི་པ་སྟེ་ཐ་མ། གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་མི་སྐྱེ་བའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་སྐྱེ་བས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of nonarising, it is not easy to worship with arising.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་མངོན་པར་འདུ་བྱེད་པས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of being nonconditioning, it is not easy to worship with conditioning.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་གཉིས་སུ་མེད་པའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་གཉིས་ཀྱིས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of nonduality, it is not easy to worship with duality.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཟག་པ་མེད་པའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་ཟག་པ་མངོན་པར་འདུ་བྱ་བས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of being undefiled, it is not easy to worship by fashioning defilement.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་སྟོང་པ་ཉིད་ཀྱིས་ཡོངས་སུ་བསྒོས་པ་ཡིན་པས་དེ་ནི་བདག་ཏུ་ལྟ་བའམ། སེམས་ཅན་དུ་ལྟ་བའམ། སྲོག་ཏུ་ལྟ་བ་འམ། གང་ཟག་ཏུ་ལྟ་བ་འམ། ཆད་པར་ལྟ་བ་འམ། རྟག་པར་ལྟ་བ་འམ།
en: Friends, because the body of the Tathāgata is suffused with emptiness, it is not easy to worship with a view of self, or a view of beings, or a view of life force, or a view of persons, or a view of annihilation, or a view of permanence, or a view that holds to an ‘I,’ or a view that holds to ‘mine,’ or a view of origination, or a view of destruction.

source: ངར་འཛིན་པར་ལྟ་བའམ། ང་ཡིར་འཛིན་པར་ལྟ་བ་འམ། འབྱུང་བར་ལྟ་བ་འམ། འཇིག་པར་ལྟ་བས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ། །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་མཚན་མ་མེད་པའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་མཚན་མའི་སྤྱོད་ཡུལ་གྱིས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of signlessness, it is not easy to worship with the experience of signs.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་སྨོན་པ་མེད་པའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་སྨོན་པ་ལ་གནས་པས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of wishlessness, it is not easy to worship by continuing to make wishes.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་དངོས་པོ་མེད་པའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་དངོས་པོའི་འདུ་ཤེས་ལ་གནས་པས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of nonexistence, it is not easy to worship by continuing to conceptualize existence.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་གཡོ་བ་མེད་པའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་གཡོ་ཞིང་འགུལ་བའི་བློ་རྣམས་ཀྱིས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of immovability, it is not easy to worship with minds that move or stir.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་མངོན་པར་འདུས་མ་བྱས་པའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་འདུས་བྱས་ལ་གནས་པས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of being unconditioned, it is not easy to worship by continuing to be conditioned.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་འདོད་ཆགས་དང་བྲལ་བའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་འདོད་ཆགས་སྤྱོད་པས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of being free from desire, it is not easy to worship by engaging in desire.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཞེ་སྡང་དང་བྲལ་བའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་གནོད་སེམས་དང་། ཐ་བའི་ཉེས་པ་ལ་གནས་པས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata has the characteristic of being freed from anger, it is not easy to worship by continuing in the faults of malice and rigidity.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་གཏི་མུག་དང་བྲལ་བའི་མཚན་ཉིད་ཡིན་པས་དེ་ནི་ཤེས་རབ་འཆལ་བ་དང་། རྨོངས་པ་དང་། མི་ཤེས་པ་རྣམས་ཀྱིས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ། །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་།
en: Friends, because the body of the Tathāgata has the characteristic of being free from ignorance, it is not easy to worship with deficient wisdom, with delusion, and with lack of knowledge.

source: རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བས་ཡོངས་སུ་བསྒོས་པ་ཡིན་པས་དེ་ནི་ཚུལ་ཁྲིམས་འཆལ་པ་དང་། བརྗེད་ངས་པ་དང་། ཤེས་རབ་འཆལ་པ་དང་། རྣམ་པར་མ་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་མ་ཡིན་པ་རྣམས་ཀྱིས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: Friends, because the body of the Tathāgata is suffused with moral discipline, samādhi, wisdom, liberation, and the knowledge and vision of liberation, it is not easy to worship with deficient moral discipline, forgetfulness, deficient wisdom, nonliberation, and the nonknowledge and non–vision of liberation.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཀྱིས་ཡོངས་སུ་བསྒོས་པ་ཡིན་པས་དེ་ནི་གནོད་སེམས་ཀྱི་སེམས་དང་ལྡན་པ་དང་། སྙིང་རྗེ་མེད་པ་དང་། དགའ་བའི་སེམས་མེད་པ་དང་།
en: Friends, because the body of the Tathāgata is suffused with love, compassion, joy, and equanimity, it is not easy to worship with a mind of malice, a lack of compassion, a lack of joy, and distracted thinking.

source: རྣམ་པར་གཡེང་བ་ཡིད་ལ་བྱེད་པ་རྣམས་ཀྱིས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ། །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱིས་ཡོངས་སུ་བསྒོས་པ་ཡིན་པས་དེ་ནི་སེར་སྣ་ཅན་དང་། ཚུལ་ཁྲིམས་འཆལ་པ་དང་། གནོད་སེམས་དང་། ཐ་བའི་ཉེས་པ་དང་། ཁོང་ཁྲོ་བ་མང་བ་དང་།
en: Friends, because the body of the Tathāgata is suffused with generosity, moral discipline, patience, diligence, concentration, and wisdom, it is not easy to worship with avarice, deficient moral discipline, malice, the fault of rigidity, wrath, laziness, forgetfulness, and deficient wisdom.’ “

source: ལེ་ལོ་ཅན་དང་། བརྗེད་ངས་པ་དང་། ཤེས་རབ་འཆལ་པ་རྣམས་ཀྱིས་མཆོད་པར་སླ་བ་མ་ཡིན་ནོ། །འོད་སྲུང་དེ་ལྟར་དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་ཀྱིས་འཁོར་དེ་དག་ལ་དེ་ལྟ་དེ་ལྟར་ཆོས་བསྟན་པ་ན་འཁོར་དེ་ལས་བྱང་ཆུབ་སེམས་དཔའ་བཞི་ཁྲི་ཉིས་སྟོང་གིས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Kāśyapa, when the monks Dharma and Sudharma taught the Dharma in that way to those in the assembly, forty-two thousand bodhisattvas from the assembly attained acceptance that phenomena do not arise.

source: །སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ནི་ཤེས་པ་དང་མཐོང་བ་བསྐྱེད་དོ།
en: Eighty-four thousand living beings developed knowledge and vision.

source: །འདོད་ཆགས་དང་བྲལ་བ་ཉིད་དང་། ཕྱིར་མི་འོང་བ་ཉིད་ཀྱང་རྗེས་སུ་ཐོབ་པར་གྱུར་ཏོ།
en: They then also attained freedom from desire and became non-returners.

source: །སྔོན་སེམས་མ་བསྐྱེད་པའི་སྲོག་ཆགས་ཉི་ཁྲི་སུམ་སྟོང་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Twenty-three thousand living beings who had not previously done so generated the thought of unsurpassed, perfect awakening. “

source: །འོད་སྲུང་དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་གཉིས་ལྷག་པའི་བསམ་པ་དེ་ལྟ་བུ་དང་ལྡན་པར་གྱུར་པ་ལ་ལྟོས།
en: Kāśyapa, consider that the two monks Dharma and Sudharma came to possess such a noble intention!

source: །འོད་སྲུང་སྐྱེས་བུ་དམ་པ་དེ་ལྟ་བུ་དག་གི་ཟབ་མོ་ལ་བཟོད་པ་དེ་དང་། ཐབས་ལ་མཁས་པ་དེ་ལ་བསླབ་པར་བྱའོ།
en: Kāśyapa, one should train oneself in the acceptance of the profound and the skillful means that such holy beings possess.

source: །འོད་སྲུང་དེ་ལྟར་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱིས་དགེ་སློང་དང་། ལྷ་དེ་དག་ཟབ་མོའི་བཟོད་པ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པས་དེ་ཕྱིན་ཆད་དེ་དག་ཐམས་ཅད་བདག་གི་དོན་ལ་སྦྱོར་བའི་རྗེས་སུ་བརྩོན་པ་དང་། བྱ་བ་ཉུང་ངུར་གནས་པས་གནས་པར་གྱུར་ཅིང་ཕྱིན་ཆད་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་རྣམས་ཀྱི་དྲུང་དུ་ཡང་མི་འགྲོ།
en: Kāśyapa, because those two holy beings caused the monks and gods to acquire acceptance of the profound, all of them, from then on, assiduously practiced for their own good and remained with few activities.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་བརྩོན་པར་ཡང་མི་བྱེད་དོ།
en: And from then on, they did not go to the stūpas of the Tathāgata or exert themselves in acts of worshiping the relics of the Tathāgata.

source: འདི་ལྟར་དེ་དག་གི་སེམས་ཆོས་ཟབ་མོ་བླ་ན་མེད་པ་ཡང་དག་པ་ཉིད་ལ་ཞུགས་པར་གྱུར་པའི་ཕྱིར་རོ།
en: Because their minds had entered in that way into the authentic, unsurpassed, and profound Dharma. “

source: །འོད་སྲུང་དེ་ནས་ཞག་བདུན་འདས་ནས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དེ་དག་ཐམས་ཅད་ཀྱང་ས་ལ་ནུབ་པར་གྱུར།
en: Then, Kāśyapa, after seven days had passed, all the stūpas of the Tathāgata sank into the ground.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ཐམས་ཅད་ཀྱང་སྤྲོག་མར་བླུགས་པ་བཞིན་ནམ། སྣོད་དུ་བླུགས་པ་བཞིན་དུ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏེ།
en: At that moment, all the relics of the Tathāgata, as if they were placed into a basket or poured into a container, became invisible.
